app/interactors/authenticate_client.rb

SELECT "clients".* FROM "clients" WHERE "clients"."email" = ? LIMIT ?  [["email", "gabriel@email.com"], ["LIMIT", 1]]
---
  def call
    client = Client.find_by email: context.email