app/interactors/find_coach.rb

SELECT "coaches".* FROM "coaches" WHERE "coaches"."name" = ? LIMIT ?  [["name", "Mr. Pink"], ["LIMIT", 1]]
---
  def call
    name  = context.coach_name
    coach = Coach.find_by name: name