app/controllers/coaches_controller.rb

SELECT "coaches".* FROM "coaches"
---
  def index
    render status: :ok, json: { coaches: Coach.all }